import { CS } from "#gc.model"
const CaseKilowatt: CS.Case ={
    'name': '千瓦武器箱',
    'price': 10.38 + 17,
    'items': {
        '蓝': [
            {
                'name': 'MAC-10 | 灯箱',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 6.69,
                        '暗金': 29.3
                    },
                    '略有磨损': {
                        '普通': 1.93,
                        '暗金': 6.04
                    },
                    '久经沙场': {
                        '普通': 1.11,
                        '暗金': 2.87
                    },
                    '破损不堪': {
                        '普通': 0.99,
                        '暗金': 2.18
                    },
                    '战痕累累': {
                        '普通': 0.96,
                        '暗金': 2.19
                    }

                }
            },
            {
                'name': 'SSG 08 | 灾难',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 2.92,
                        '暗金': 16.4
                    },
                    '略有磨损': {
                        '普通': 1.82,
                        '暗金': 4.27
                    },
                    '久经沙场': {
                        '普通': 1.17,
                        '暗金': 2.46
                    },
                    '破损不堪': {
                        '普通': 1.09,
                        '暗金': 2.24
                    },
                    '战痕累累': {
                        '普通': 0.98,
                        '暗金': 2.1
                    }
                }
            },
            {
                'name': 'Tec-9 | 渣渣',
                'minFloat': 0,
                'maxFloat': 0.9,
                'prices': {
                    '崭新出厂': {
                        '普通': 2.29,
                        '暗金': 8.62
                    },
                    '略有磨损': {
                        '普通': 1.81,
                        '暗金': 4.28
                    },
                    '久经沙场': {
                        '普通': 1.08,
                        '暗金': 2.46
                    },
                    '破损不堪': {
                        '普通': 1.07,
                        '暗金': 2.43
                    },
                    '战痕累累': {
                        '普通': 0.98,
                        '暗金': 2.15
                    }
                }
            },
            {
                'name': 'UMP-45 | 机动化',
                'minFloat': 0,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 2.84,
                        '暗金': 7.67
                    },
                    '略有磨损': {
                        '普通': 1.8,
                        '暗金': 4.38
                    },
                    '久经沙场': {
                        '普通': 1.08,
                        '暗金': 2.87
                    },
                    '破损不堪': {
                        '普通': 1.06,
                        '暗金': 3.91
                    },
                    '战痕累累': {
                        '普通': 0.97,
                        '暗金': 2.5
                    }
                }
            },
            {
                'name': 'XM1014 | 刺青',
                'minFloat': 0,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 2.76,
                        '暗金': 9.4
                    },
                    '略有磨损': {
                        '普通': 1.91,
                        '暗金': 4
                    },
                    '久经沙场': {
                        '普通': 1.08,
                        '暗金': 2.47
                    },
                    '破损不堪': {
                        '普通': 1.05,
                        '暗金': 2.57
                    },
                    '战痕累累': {
                        '普通': 0.96,
                        '暗金': 2.11
                    }
                }
            },
            {
                'name': '双持贝瑞塔 | 藏身处',
                'minFloat': 0,
                'maxFloat': 0.7,
                'prices': {
                    '崭新出厂': {
                        '普通': 2.74,
                        '暗金': 6.29
                    },
                    '略有磨损': {
                        '普通': 1.95,
                        '暗金': 4.31
                    },
                    '久经沙场': {
                        '普通': 1.1,
                        '暗金': 2.45
                    },
                    '破损不堪': {
                        '普通': 1.11,
                        '暗金': 2.39
                    },
                    '战痕累累': {
                        '普通': 0.99,
                        '暗金': 2.1
                    }
                }
            },
            {
                'name': '新星 | 黑暗徽记',
                'minFloat': 0,
                'maxFloat': 0.7,
                'prices': {
                    '崭新出厂': {
                        '普通': 2.86,
                        '暗金': 6.64
                    },
                    '略有磨损': {
                        '普通': 1.8,
                        '暗金': 4.61
                    },
                    '久经沙场': {
                        '普通': 1.11,
                        '暗金': 2.44
                    },
                    '破损不堪': {
                        '普通': 1.23,
                        '暗金': 2.31
                    },
                    '战痕累累': {
                        '普通': 0.97,
                        '暗金': 2.12
                    }
                }
            }
        ],
        '紫': [
            {
                'name': 'FN57 | 混合体',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 24.8,
                        '暗金': 58
                    },
                    '略有磨损': {
                        '普通': 15.89,
                        '暗金': 36.19
                    },
                    '久经沙场': {
                        '普通': 10,
                        '暗金': 22
                    },
                    '破损不堪': {
                        '普通': 9.41,
                        '暗金': 21
                    },
                    '战痕累累': {
                        '普通': 9.36,
                        '暗金': 19.9
                    }
                }
            },
            {
                'name': 'M4A4 | 蚀刻领主',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 24.98,
                        '暗金': 71
                    },
                    '略有磨损': {
                        '普通': 15.4,
                        '暗金': 37.33
                    },
                    '久经沙场': {
                        '普通': 10,
                        '暗金': 21.7
                    },
                    '破损不堪': {
                        '普通': 9.3,
                        '暗金': 21.1
                    },
                    '战痕累累': {
                        '普通': 9.38,
                        '暗金': 19.9
                    }
                }
            },
            {
                'name': 'MP7 | 笑一个',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 24.1,
                        '暗金': 59.89
                    },
                    '略有磨损': {
                        '普通': 15.48,
                        '暗金': 36.87
                    },
                    '久经沙场': {
                        '普通': 10.96,
                        '暗金': 21.58
                    },
                    '破损不堪': {
                        '普通': 9.45,
                        '暗金': 21.9
                    },
                    '战痕累累': {
                        '普通': 9.35,
                        '暗金': 19.79
                    }
                }
            },
            {
                'name': '截短霰弹枪 | 模拟输入',
                'minFloat': 0,
                'maxFloat': 0.62,
                'prices': {
                    '崭新出厂': {
                        '普通': 23.4,
                        '暗金': 56.47
                    },
                    '略有磨损': {
                        '普通': 15.62,
                        '暗金': 37.28
                    },
                    '久经沙场': {
                        '普通': 10.7,
                        '暗金': 22.4
                    },
                    '破损不堪': {
                        '普通': 9.63,
                        '暗金': 21.09
                    },
                    '战痕累累': {
                        '普通': 9.35,
                        '暗金': 20.39
                    }
                }
            },
            {
                'name': '格洛克 18 型 | 崩络克-18',
                'minFloat': 0,
                'maxFloat': 0.67,
                'prices': {
                    '崭新出厂': {
                        '普通': 26.99,
                        '暗金': 72
                    },
                    '略有磨损': {
                        '普通': 18,
                        '暗金': 44.6
                    },
                    '久经沙场': {
                        '普通': 11.35,
                        '暗金': 23.53
                    },
                    '破损不堪': {
                        '普通': 10.59,
                        '暗金': 25
                    },
                    '战痕累累': {
                        '普通': 9.32,
                        '暗金': 20.7
                    }
                }
            }
        ],
        '粉': [
            {
                'name': 'M4A1 消音型 | 黑莲花',
                'minFloat': 0,
                'maxFloat': 0.7,
                'prices': {
                    '崭新出厂': {
                        '普通': 286.99,
                        '暗金': 644.99
                    },
                    '略有磨损': {
                        '普通': 194,
                        '暗金': 388
                    },
                    '久经沙场': {
                        '普通': 139.99,
                        '暗金': 263.5
                    },
                    '破损不堪': {
                        '普通': 136.5,
                        '暗金': 290
                    },
                    '战痕累累': {
                        '普通': 141,
                        '暗金': 281
                    }
                }
            },
            {
                'name': 'USP 消音版 | 破颚者',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 198,
                        '暗金': 554
                    },
                    '略有磨损': {
                        '普通': 120.98,
                        '暗金': 273
                    },
                    '久经沙场': {
                        '普通': 76.3,
                        '暗金': 159.5
                    },
                    '破损不堪': {
                        '普通': 67.26,
                        '暗金': 135
                    },
                    '战痕累累': {
                        '普通': 60.98,
                        '暗金': 128.8
                    }
                }
            },
            {
                'name': '宙斯 X27 电击枪 | 奥林匹斯',
                'minFloat': 0,
                'maxFloat': 0.67,
                'prices': {
                    '崭新出厂': {
                        '普通': 173.5,
                        '暗金': 490
                    },
                    '略有磨损': {
                        '普通': 119.5,
                        '暗金': 300
                    },
                    '久经沙场': {
                        '普通': 77.75,
                        '暗金': 204.5
                    },
                    '破损不堪': {
                        '普通': 68.14,
                        '暗金': 201.4
                    },
                    '战痕累累': {
                        '普通': 61,
                        '暗金': 181.5
                    }
                }
            }
        ],
        '红': [
            {
                'name': 'AK-47 | 传承',
                'minFloat': 0,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 1900,
                        '暗金': 4450
                    },
                    '略有磨损': {
                        '普通': 1149.5,
                        '暗金': 2229.5
                    },
                    '久经沙场': {
                        '普通': 719.5,
                        '暗金': 1176.5
                    },
                    '破损不堪': {
                        '普通': 669.5,
                        '暗金': 1046.66
                    },
                    '战痕累累': {
                        '普通': 548,
                        '暗金': 885
                    }
                }
            },
            {
                'name': 'AWP | 镀铬大炮',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 1499,
                        '暗金': 2885.99
                    },
                    '略有磨损': {
                        '普通': 823.4,
                        '暗金': 1435
                    },
                    '久经沙场': {
                        '普通': 542.9,
                        '暗金': 806
                    },
                    '破损不堪': {
                        '普通': 389.99,
                        '暗金': 624.8
                    },
                    '战痕累累': {
                        '普通': 370,
                        '暗金': 614.99
                    }
                }
            }
        ],
        '金': [
            {
                'name': '廓尔喀刀（★）',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 5000,
                        '暗金': 4900
                    },
                    '略有磨损': {
                        '普通': 5000,
                        '暗金': 4900
                    },
                    '久经沙场': {
                        '普通': 5000,
                        '暗金': 4900
                    },
                    '破损不堪': {
                        '普通': 5000,
                        '暗金': 4900
                    },
                    '战痕累累': {
                        '普通': 5000,
                        '暗金': 4900
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 人工染色',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 3799.5,
                        '暗金': 3699.5
                    },
                    '略有磨损': {
                        '普通': 3114.5,
                        '暗金': 3089.5
                    },
                    '久经沙场': {
                        '普通': 2750,
                        '暗金': 2779.99
                    },
                    '破损不堪': {
                        '普通': 2519,
                        '暗金': 2549.22
                    },
                    '战痕累累': {
                        '普通': 2398,
                        '暗金': 2500
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 北方森林',
                'minFloat': 0.06,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 4398.5,
                        '暗金': 4298.5
                    },
                    '略有磨损': {
                        '普通': 2287.5,
                        '暗金': 2229.5,
                    },
                    '久经沙场': {
                        '普通': 1872.5,
                        '暗金': 1857.5
                    },
                    '破损不堪': {
                        '普通': 1835,
                        '暗金': 2099.5
                    },
                    '战痕累累': {
                        '普通': 1820,
                        '暗金': 2218.9
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 夜色',
                'minFloat': 0.06,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 6288,
                        '暗金': 6000
                    },
                    '略有磨损': {
                        '普通': 2899,
                        '暗金': 3284
                    },
                    '久经沙场': {
                        '普通': 2100,
                        '暗金': 2200
                    },
                    '破损不堪': {
                        '普通': 2038,
                        '暗金': 2059
                    },
                    '战痕累累': {
                        '普通': 2076,
                        '暗金': 2079
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 屠夫',
                'minFloat': 0.01,
                'maxFloat': 0.26,
                'prices': {
                    '崭新出厂': {
                        '普通': 5744,
                        '暗金': 5750
                    },
                    '略有磨损': {
                        '普通': 4988,
                        '暗金': 4900
                    },
                    '久经沙场': {
                        '普通': 4790,
                        '暗金': 5100
                    },
                    '破损不堪': {
                        '普通': 0,
                        '暗金': 0
                    },
                    '战痕累累': {
                        '普通': 0,
                        '暗金': 0
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 枯焦之色',
                'minFloat': 0.06,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 4490,
                        '暗金': 4390
                    },
                    '略有磨损': {
                        '普通': 2418.5,
                        '暗金': 2500
                    },
                    '久经沙场': {
                        '普通': 1820,
                        '暗金': 1880
                    },
                    '破损不堪': {
                        '普通': 1869.5,
                        '暗金': 1899
                    },
                    '战痕累累': {
                        '普通': 1880,
                        '暗金': 2139.8
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 森林 DDPAT',
                'minFloat': 0.06,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 4500,
                        '暗金': 4400
                    },
                    '略有磨损': {
                        '普通': 2443,
                        '暗金': 2550
                    },
                    '久经沙场': {
                        '普通': 1987,
                        '暗金': 1955.55
                    },
                    '破损不堪': {
                        '普通': 1943,
                        '暗金': 1995
                    },
                    '战痕累累': {
                        '普通': 1820,
                        '暗金': 2134
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 深红之网',
                'minFloat': 0.06,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 17999,
                        '暗金': 16999
                    },
                    '略有磨损': {
                        '普通': 6048,
                        '暗金': 6098
                    },
                    '久经沙场': {
                        '普通': 4019,
                        '暗金': 3959
                    },
                    '破损不堪': {
                        '普通': 3650,
                        '暗金': 3888.88
                    },
                    '战痕累累': {
                        '普通': 2848,
                        '暗金': 2850
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 渐变之色',
                'minFloat': 0.00,
                'maxFloat': 0.08,
                'prices': {
                    '崭新出厂': {
                        '普通': 8259,
                        '暗金': 8599
                    },
                    '略有磨损': {
                        '普通': 8887.5,
                        '暗金': 8887.5
                    },
                    '久经沙场': {
                        '普通': 0,
                        '暗金': 0
                    },
                    '破损不堪': {
                        '普通': 0,
                        '暗金': 0
                    },
                    '战痕累累': {
                        '普通': 0,
                        '暗金': 0
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 狩猎网格',
                'minFloat': 0.06,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 3230,
                        '暗金': 3230
                    },
                    '略有磨损': {
                        '普通': 2080,
                        '暗金': 2070
                    },
                    '久经沙场': {
                        '普通': 1780,
                        '暗金': 1843.99
                    },
                    '破损不堪': {
                        '普通': 1799.5,
                        '暗金': 1799.5
                    },
                    '战痕累累': {
                        '普通': 1877.88,
                        '暗金': 1877.88
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 蓝钢',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 5100,
                        '暗金': 6100
                    },
                    '略有磨损': {
                        '普通': 3949,
                        '暗金': 3977.5
                    },
                    '久经沙场': {
                        '普通': 3780,
                        '暗金': 3498.5
                    },
                    '破损不堪': {
                        '普通': 3449,
                        '暗金': 3598.5
                    },
                    '战痕累累': {
                        '普通': 3659,
                        '暗金': 3699
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 表面淬火',
                'minFloat': 0,
                'maxFloat': 1,
                'prices': {
                    '崭新出厂': {
                        '普通': 6499.5,
                        '暗金': 8400
                    },
                    '略有磨损': {
                        '普通': 4140,
                        '暗金': 4299
                    },
                    '久经沙场': {
                        '普通': 3675.99,
                        '暗金': 3350
                    },
                    '破损不堪': {
                        '普通': 3229.5,
                        '暗金': 3250
                    },
                    '战痕累累': {
                        '普通': 3070.5,
                        '暗金': 3199.5
                    }
                }
            },
            {
                'name': '廓尔喀刀（★） | 都市伪装',
                'minFloat': 0.06,
                'maxFloat': 0.8,
                'prices': {
                    '崭新出厂': {
                        '普通': 5699.5,
                        '暗金': 5699.5
                    },
                    '略有磨损': {
                        '普通': 2450,
                        '暗金': 3010
                    },
                    '久经沙场': {
                        '普通': 1844.5,
                        '暗金': 1990
                    },
                    '破损不堪': {
                        '普通': 1864.5,
                        '暗金': 1996.5
                    },
                    '战痕累累': {
                        '普通': 1899,
                        '暗金': 2060
                    }
                }
            }
        ]
    },
    'rarity': {
        '金': 0.26,
        '红': 0.64,
        '粉': 3.2,
        '紫': 15.98,
        '蓝': 79.92
    }
};

export default CaseKilowatt;
